#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pathivadaorg/demo-github-actions/runs/run-gpFcsAcm6PjNGjLd

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=uncommon-viper]
data.aws_iam_policy_document.example: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_iam_policy_document.require_mfa_ec2_actions: Reading...
data.aws_iam_policy_document.deny_region_interaction: Reading...
data.aws_ssoadmin_instances.example: Reading...
aws_security_group.web-sg: Refreshing state... [id=sg-04c25adf15464f282]
data.aws_iam_policy_document.example: Read complete after 0s [id=213453844]
data.aws_iam_policy_document.require_mfa_ec2_actions: Read complete after 0s [id=3458749608]
data.aws_iam_policy_document.deny_region_interaction: Read complete after 0s [id=3057638609]
aws_organizations_policy.deny_region_interaction: Refreshing state... [id=p-obd4qib3]
aws_organizations_policy.require_mfa_ec2_actions: Refreshing state... [id=p-my5of4ae]
data.aws_ssoadmin_instances.example: Read complete after 0s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0070c5311b7677678]
aws_instance.web: Refreshing state... [id=i-0d7e9b2b6e31eb1b5]
aws_organizations_policy_attachment.deny_region_interaction_attachment: Refreshing state... [id=ou-a6ih-akiwo6r2:p-obd4qib3]
aws_organizations_policy_attachment.require_mfa_ec2_actions_attachment: Refreshing state... [id=ou-a6ih-akiwo6r2:p-my5of4ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssoadmin_permission_set.example will be created
  + resource "aws_ssoadmin_permission_set" "example" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-7223c38a158e173f"
      + name             = "Example"
      + session_duration = "PT1H"
    }

  # aws_ssoadmin_permission_set_inline_policy.example will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "example" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                      + Sid      = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7223c38a158e173f"
      + permission_set_arn = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-gpFcsAcm6PjNGjLd/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-gpFcsAcm6PjNGjLd/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @murali12180, Action: `pull_request`*